# encoding=utf8
"""
    Author:  'jdwang'
    Date:    'create date: 2016-10-08'; 'last updated date: 2016-10-08'
    Email:   '383287471@qq.com'
    Describe: OOD 检测
"""
from __future__ import print_function

sight_data = [{"id": 1, "name": "西湖", "lat": 30.257793, "lng": 120.141377},
              {"id": 2, "name": "灵隐寺", "lat": 30.246211, "lng": 120.112482},
              {"id": 3, "name": "雷峰塔", "lat": 30.237545, "lng": 120.15623},
              {"id": 4, "name": "西溪湿地公园（东区）", "lat": 30.248348, "lng": 120.057856},
              {"id": 5, "name": "清河坊街", "lat": 30.245392, "lng": 120.176709},
              {"id": 6, "name": "三潭印月", "lat": 30.244082, "lng": 120.150684},
              {"id": 7, "name": "千岛湖景区", "lat": 29.593633, "lng": 119.016777},
              {"id": 8, "name": "白堤", "lat": 30.258308, "lng": 120.15248},
              {"id": 9, "name": "苏堤", "lat": 30.234706, "lng": 120.150793},
              {"id": 10, "name": "曲院风荷", "lat": 30.257138, "lng": 120.140566},
              {"id": 11, "name": "杭州宋城景区", "lat": 30.176543, "lng": 120.103968},
              {"id": 12, "name": "太子湾公园", "lat": 30.232561, "lng": 120.148903},
              {"id": 13, "name": "杭州灵隐（飞来峰）景区", "lat": 30.243021, "lng": 120.107263},
              {"id": 14, "name": "断桥残雪", "lat": 30.265108, "lng": 120.158666},
              {"id": 15, "name": "花港观鱼", "lat": 30.236859, "lng": 120.146626},
              {"id": 16, "name": "牛皋墓", "lat": 30.263696, "lng": 120.143689},
              {"id": 17, "name": "兜云亭", "lat": 30.198114, "lng": 120.100558},
              {"id": 18, "name": "美女坝", "lat": 30.267291, "lng": 120.399371},
              {"id": 19, "name": "十二生肖石", "lat": 30.241204, "lng": 120.171509},
              {"id": 20, "name": "中共杭州小组纪念馆", "lat": 30.257746, "lng": 120.183915},
              {"id": 21, "name": "彻天彻地童玩中心", "lat": 30.354184, "lng": 120.008967},
              {"id": 22, "name": "新安江水上观坝", "lat": 29.480383, "lng": 119.245923},
              {"id": 23, "name": "富春江小三峡", "lat": 29.718229, "lng": 119.655179},
              {"id": 24, "name": "俞曲园墓（含右台仙馆）", "lat": 30.235322, "lng": 120.136722},
              {"id": 25, "name": "忠义亭", "lat": 30.24593, "lng": 120.176715},
              {"id": 26, "name": "林海亭", "lat": 30.202157, "lng": 120.119998},
              {"id": 27, "name": "余杭蓝莓采摘", "lat": 30.328992, "lng": 119.901569},
              {"id": 28, "name": "双泉村", "lat": 29.268291, "lng": 119.27209},
              {"id": 29, "name": "孙花翁墓", "lat": 30.265545, "lng": 120.156386},
              {"id": 30, "name": "牡丹亭", "lat": 30.235915, "lng": 120.145902}]
# 相同意思词语转换
same_name = {
    u'西溪湿地公园': u'西溪湿地公园（东区）',

    u'灵隐': u'灵隐寺',

    u'飞来峰': u'杭州灵隐（飞来峰）景区',

    u'俞曲园墓': u'俞曲园墓（含右台仙馆）',

}



sight_names = [item['name'].decode('utf8') for item in sight_data]
sight_names += same_name.keys()
print('the number of sights is : %d'%len(sight_names))
print(','.join(sight_names))

sight_details = {"1": {"id": "1", "name": "西湖",
                       "img": "http://dimg02.c-ctrip.com/images/fd/tg/g1/M0A/67/BA/CghzflWsuTOAHRsyAB40GAEXzmw876_R_1600_10000_Mtg_7.jpg",
                       "tags": "湖泊 世界文化遗产 国际公园",
                       "des": "西湖无疑是杭州之美的代表，著名的“西湖十景”环绕湖边，自然与人文相互映衬，组成了杭州旅行的核心地带。你不必执着于走遍每个景点，倒可以花上半天或一天在湖边悠闲地徜徉一番，无论怎么玩，都让人心情舒畅。",
                       "time": "0.5-1天"},
                 "2": {"id": "2", "name": "灵隐寺",
                       "img": "http://dimg02.c-ctrip.com/images/fd/tg/g2/M06/8E/4E/CghzgFWxCL6AeMgFABKrkPlBk_k350_R_1600_10000_Mtg_7.jpg",
                       "tags": "寺庙 古迹",
                       "des": "灵隐寺又称“云林寺”，坐落于西湖西面的灵隐山麓。寺内环境清幽，是杭州最早的名刹，留存着各朝代众多精美文物。这里是济公的出家地，据说求愿很灵验，每天来礼佛祈福的香客络绎不绝。",
                       "time": "1-2小时"},
                 "3": {"id": "3", "name": "雷峰塔",
                       "img": "http://dimg05.c-ctrip.com/images/fd/tg/g2/M02/8B/6D/Cghzf1Ww4jmADduYAAQIU8fraQE220_C_1600_1200_Mtg_7.jpg",
                       "tags": "古迹 古塔",
                       "des": "雷峰塔又名“黄妃塔”，位于西湖南岸夕照山的雷峰上。很多人的“雷峰塔情结”源于白娘子传说，尽管旧塔在1924年就倒掉了，如今这座是在原塔基上新修的，里面有电梯和空调，但并不妨碍你来此寻访白娘子的踪迹。",
                       "time": "1-2小时"},
                 "4": {"id": "4", "name": "西溪湿地公园（东区）",
                       "img": "http://dimg08.c-ctrip.com/images/fd/tg/g1/M06/CA/F4/CghzflWw4kmAQdJTAALsejfqndU453_C_1600_1200_Mtg_7.jpg",
                       "tags": "湿地 游船",
                       "des": "西溪国家湿地公园位于市区西面，这里环境清幽、水道纵横，是城市中少有的天然湿地，有“杭州之肾”之称。坐船漫游芦苇荡、寻迹《非诚勿扰》取景处，或是探访隐于林中的秋雪庵、梅竹山庄等古迹，都是非常享受的体验。",
                       "time": "3-6小时"}, "5": {"id": "5", "name": "清河坊街",
                                               "img": "http://dimg08.c-ctrip.com/images/tg/950/122/806/6852aeb6087c44b49104e82681c58c75_C_1600_1200_Mtg_7.jpg",
                                               "tags": "古迹 特色街区",
                                               "des": "清河坊街是杭州人气最旺的商业区之一，沿街的商铺是老建筑改建的，古色古香。这里各种本地小吃、老字号、茶楼云集，加上背靠吴山，又与美食街高银街近邻，无论是游客还是本地人都常来光顾。",
                                               "time": "2-3小时"}, "6": {"id": "6", "name": "三潭印月",
                                                                       "img": "http://dimg09.c-ctrip.com/images/fd/tg/g1/M01/79/8B/CghzfVWwqseAT62YAAOoDfp4Y-8813_C_1600_1200_Mtg_7.jpg",
                                                                       "tags": "湖泊",
                                                                       "des": "三潭印月又称“小瀛洲”，位于西湖中部偏南的湖面上，是西湖三岛中面积最大、唯一能上岛游览的一个。岛屿的轮廓像一个“田”字，外圈的环形上是优美的江南园林，内部被十字形的岛和桥分割成四个小湖，充满诗情画意。",
                                                                       "time": "1-2小时"},
                 "7": {"id": "7", "name": "千岛湖景区",
                       "img": "http://dimg07.c-ctrip.com/images/fd/tg/g1/M01/37/AA/CghzfVW3O_-AW9gYAA1DBpnUjag331_R_1600_10000_Mtg_7.jpg",
                       "tags": "游船 湖泊",
                       "des": "千岛湖更准确地讲是新安江水库，位于杭州淳安县，是新安江大坝截流后形成的人工湖。这里湖水清澈，湖面上岛屿星罗棋布，是江浙度假休闲的热门选择。千岛湖周边有十几处漂流点，夏日消暑不可错过。",
                       "time": "1-2天"}, "8": {"id": "8", "name": "白堤",
                                              "img": "http://dimg07.c-ctrip.com/images/fd/tg/g2/M03/87/8B/CghzgFWwqreANgWEAANnVzf2Z6M498_C_1600_1200_Mtg_7.jpg",
                                              "tags": "古迹",
                                              "des": "白堤原名白沙堤，它一端连着断桥，一端接着平湖秋月和孤山，中间是平坦的柏油路。道路两边种着整齐的杨柳和桃树，抬眼便是西湖美景，很适合悠闲漫步。白居易的名句“最爱湖东行不足，绿杨荫里白沙堤”说的就是这里。",
                                              "time": "1-2小时"}, "9": {"id": "9", "name": "苏堤",
                                                                      "img": "http://dimg07.c-ctrip.com/images/fd/tg/g4/M08/C4/B8/CggYHlaDgBuACVIMAJUsS64588Y982_R_1600_10000_Mtg_7.jpg",
                                                                      "tags": "古迹",
                                                                      "des": "苏堤贯穿西湖南北，是苏东坡在杭州做官时所建，也叫“苏公堤”。因春景迷人，亦被称为“苏堤春晓”。苏堤全长近3公里，堤上柏油路两侧柳树成荫。你可以漫步欣赏三潭印月、雷峰塔等西湖美景，人少时骑单车也很不错。",
                                                                      "time": "1-2小时"},
                 "10": {"id": "10", "name": "曲院风荷",
                        "img": "http://dimg09.c-ctrip.com/images/fd/tg/g4/M09/CA/62/CggYHVaDe96AYpQLAHpAoyCN8Lg954_R_1600_10000_Mtg_7.jpg",
                        "tags": "池塘城市公园",
                        "des": "曲院风荷位于西湖西侧，岳王庙前面，是杭州著名的赏荷地。相传南宋时，洪春桥畔有一家官家酿酒的作坊，作坊周围的池塘上有许多荷花。每到夏天，微风乍起，荷花的香味夹杂着酒香，沁人心脾，“曲院风荷”由此得名。",
                        "time": "1小时"}, "11": {"id": "11", "name": "杭州宋城景区",
                                               "img": "http://dimg09.c-ctrip.com/images/tg/088/338/836/470ad44f6192469f86209d5dbc08b9ae_C_1600_1200_Mtg_7.jpg",
                                               "tags": "游戏/娱乐中心 主题公园",
                                               "des": "宋城位于杭州西南市郊，是一座大型宋代文化主题乐园。充满宋代风情的仿古茶楼、杂货铺、打铁铺、酒坊等随处可见。街上有木偶戏、皮影戏、打擂台等表演，还会遇到披甲士兵巡街或是缉拿逃犯，给人一种奇妙的穿越感。",
                                               "time": "3-6小时"}, "12": {"id": "12", "name": "太子湾公园",
                                                                        "img": "http://dimg01.c-ctrip.com/images/fd/tg/g2/M02/89/F8/CghzgFWwxyyAIV_vABCMdjYF6o8689_R_1600_10000_Mtg_7.jpg",
                                                                        "tags": "城市公园",
                                                                        "des": "太子湾公园位于西湖的西南角，花港观鱼景区南门正对面，离苏堤、杨公堤都不远。这里春天的郁金香最为出名，此外，无论你什么时候来到这里，都能看到不少拍婚纱照的新人和约会的情侣，让整个公园充满了浪漫气息。",
                                                                        "time": "2小时"},
                 "13": {"id": "13", "name": "杭州灵隐（飞来峰）景区",
                        "img": "http://dimg05.c-ctrip.com/images/fd/tg/g3/M07/D4/6D/CggYG1bGpNGAQtQKAAhEJd3M3ZI479_R_1600_10000_Mtg_7.jpg",
                        "tags": "寺庙山岳/山岭古迹",
                        "des": "灵隐（飞来峰）景区位于西湖西面，包括灵隐寺和飞来峰两个主要景观。飞来峰不大也不高，却汇聚了几百处不同朝代的菩萨、高僧造像，有种融合之美。山中的灵隐寺是杭州最古老的寺院，香火旺盛，可以买香花券入寺祈愿。",
                        "time": "2小时"}, "14": {"id": "14", "name": "断桥残雪",
                                               "img": "http://dimg07.c-ctrip.com/images/fd/tg/g4/M01/6D/6B/CggYHlbXW7eAV-WdAALfSsGiQyI393_R_1600_10000_Mtg_7.jpg",
                                               "tags": "桥",
                                               "des": "断桥位于白堤北端，连着北山路。《白蛇传》中许仙、白娘子断桥相会的桥段使断桥尽人皆知，也给这座长桥添了许多浪漫色彩。游人来到杭州，总免不了要来断桥走走，甚至憧憬一下在桥上碰到自己百年修来的“有缘人”。",
                                               "time": "10-20分钟"}, "15": {"id": "15", "name": "花港观鱼",
                                                                          "img": "http://dimg06.c-ctrip.com/images/fd/tg/g3/M09/0F/D2/CggYGVbKsjqAKa_RAAd3XqT7PsY302_R_1600_10000_Mtg_7.jpg",
                                                                          "tags": "城市公园",
                                                                          "des": "花港观鱼位于西湖南面，苏堤入口附近。这里曾是一处私家宅院，如今是一座漂亮的免费公园，位列“西湖十景”之一。园中最出名的要数红鱼池中成群结队的红鲤鱼，总有大人小孩拿饲料、面包屑给鱼儿喂食，不亦乐乎。",
                                                                          "time": "1-2小时"},
                 "16": {"id": "16", "name": "牛皋墓", "img": "", "tags": "陵园/墓地",
                        "des": "牛皋，字伯远，河南鲁山人，南宋抗金将领，岳飞部将。原墓于1955年清理孤山墓葬时废，1987年重修。现墓位于杭州西湖栖霞岭剑门关紫云洞口，坐西朝东，成圆形拱顶，下条石围砌，上封土植草。直径3.5米，高1.8米。外围圈式短墙，依山傍道。墓前立“宋辅文侯牛皋之墓”碑，墓道前构筑两柱一间石坊。墓碑及石坊为重修之物。",
                        "time": "30-40分钟"}, "17": {"id": "17", "name": "兜云亭",
                                                   "img": "http://dimg05.c-ctrip.com/images/fd/tg/g2/M00/72/EA/CghzgFUmECGAA3veAAPRm84bmnM772_C_1600_1200_Mtg_7.jpg",
                                                   "tags": "古迹",
                                                   "des": "兜云亭为新西湖十景“云栖竹径”五云山入口。位于西湖西南五云山下的云栖坞，竹景之美位列西湖之冠。它在西湖诸景中最僻远幽静，获“湖山第一岙区”美名。相传，五云山中飘出的五彩祥云常在此停留，故名“云栖”。",
                                                   "time": "10-20分钟"}, "18": {"id": "18", "name": "美女坝",
                                                                              "img": "http://dimg08.c-ctrip.com/images/fd/tg/g4/M06/D5/FC/CggYHVYRKG2AShWCAAJK9PB0BSo677_R_10000_1200_Mtg_7.jpg",
                                                                              "tags": "观景台",
                                                                              "des": "美女坝，位于杭州市萧山区美女山北部的钱塘江边。是由南向北直入江中的丁字坝，是观看钱塘江大潮的观潮圣地之一 。",
                                                                              "time": "30-60分钟"},
                 "19": {"id": "19", "name": "十二生肖石",
                        "img": "http://dimg07.c-ctrip.com/images/fd/tg/g1/M02/ED/1E/CghzflWTSXOANeT1ABLWpGc1haU482_R_1600_10000_Mtg_7.jpg",
                        "tags": "地质地貌礁石/岩石",
                        "des": "吴山十二生肖石为一组出露地面的石芽，属石灰岩岩溶地貌。从一定角度远远看去，这组岩石酷似鼠、牛、虎、兔、龙、蛇、马、羊、猴、鸡、狗、猪十二生肖。文人墨客则分别题名为盘龙、伏虎、鸣凤、舞鹤、象鼻、牛眠、龟息、笔架、香炉、棋盘、剑泉、玉笋，统而雅称为“巫山十二峰”。",
                        "time": "20-40分钟"}, "20": {"id": "20", "name": "中共杭州小组纪念馆", "img": "", "tags": "纪念馆",
                                                   "des": "中共杭州小组纪念馆位于杭州市上城区方古园3号，展陈面积约850平方米。一个看上去很普通的地方，却是当年我省第一个地方党组织——中共杭州小组的诞生地。",
                                                   "time": "1小时"}, "21": {"id": "21", "name": "彻天彻地童玩中心",
                                                                          "img": "http://dimg03.c-ctrip.com/images/1003050000000k0xc0464_R_10000_1200_Mtg_7.jpg",
                                                                          "tags": "主题公园",
                                                                          "des": "彻天彻地童玩探险中心-七贤郡旗舰店，总面试近3000㎡，是全国首家结合室内探险游乐，儿童职业体验、特色培训的一站式大型童玩综合体，适合3岁以上儿童及成人的探险游玩和亲子互动。由英国童玩大师D.T担纲设计、设有全亚洲目前最高的90度魔鬼滑梯、空气佳能泡等令人尖叫的设施。让孩子在潜移默化中训练协调能力，培养冒险精神。",
                                                                          "time": ""},
                 "22": {"id": "22", "name": "新安江水上观坝",
                        "img": "http://dimg05.c-ctrip.com/images/tg/937/196/944/d5851c9509e44484b57ad06773102e86_C_1600_1200_Mtg_7.jpg",
                        "tags": "水利工程",
                        "des": "新安江水电站是全国工业旅游示范点，作为我国第一座“三自”电站（即自己设计、自制设备，自行建造），见证了新中国水电发展50年的风雨历程，它是我国现今所有高水位截流式宽缝重力坝的先导建筑，被称为“长江三峡水利枢纽的试验田”，它使新安江截流成湖，其库区面积达到106平方公里，蓄水量达到178亿立方米以上，其水位正常时平均水深37.5米，淹没了一个半县城，使许多原来的小山成了如今的小岛，从空中俯瞰，只见众多小岛如翠珠般洒落在万顷碧波中，造就了蜚声中外的旅游胜地——千岛湖。登上105米高的拦河大坝顶上，站在那用以提举泄洪闸门、起重量达到300多吨的大型起重门机旁，令人生畏却又更能感到人的伟大。仰望头顶白云蓝天，俯瞰脚下一条碧玉带般的新安江水从坝体底部流出，而身后就是美丽迷人的千岛湖，这一片景象足可让人体验到一种“人在江湖”的感觉。",
                        "time": ""}, "23": {"id": "23", "name": "富春江小三峡", "img": "", "tags": "河流山岳/山岭游船",
                                            "des": "富春江小三峡是富春江风光最美的一段，它位于富春江上游桐庐七里泷至建德梅城一段河道，峡内山高谷深、水势平缓，乘坐游船最能领略这一带堪比三峡的自然风光。",
                                            "time": "2-3小时"}, "24": {"id": "24", "name": "俞曲园墓（含右台仙馆）",
                                                                     "img": "http://dimg09.c-ctrip.com/images/fd/tg/g2/M08/DC/3B/CghzgFT-cseAUGsEAAUMZMAH1Xk057_C_1600_1200_Mtg_7.jpg",
                                                                     "tags": "陵园/墓地",
                                                                     "des": "俞曲园墓位于三台山路三台山东麓。俞曲园(1821-1907)，名樾，字荫甫，号曲园，浙江德清人。清末著名学者，官翰林院编修、河南学政。曾主讲杭州诂经精舍三十余年，博通经学、易学、文学，平生著述颇丰，有经学大师之誉。现墓于1992年重修。墓附近原有右台仙馆，为俞曲园所建。俞曲园夫人姚氏死后葬于三台山之右台山，俞曲园于墓旁置地筑屋，取名右台仙馆。规划在原址附近重建，与俞曲园墓相呼应。",
                                                                     "time": "20-40分钟"},
                 "25": {"id": "25", "name": "忠义亭",
                        "img": "http://dimg06.c-ctrip.com/images/fd/tg/g1/M09/06/E6/CghzfVUYDUqAdjknAAGyydpK_Yw603_C_1600_1200_Mtg_7.jpg",
                        "tags": "古迹", "des": "忠义亭位于杭州河坊街，漫步街道远远的就能看到马路中间一个木制的亭子，上面的篇额上刻着忠义亭三个字。", "time": "10-15分钟"},
                 "26": {"id": "26", "name": "林海亭",
                        "img": "http://dimg03.c-ctrip.com/images/fd/tg/g4/M04/11/E4/CggYHVX2MteARqL_AAEuUVEeLVM013_C_1600_1200_Mtg_7.jpg",
                        "tags": "古迹",
                        "des": "林海亭建于清末民初的一座供游人歇脚的开敞路亭。亭有“天琴道人”樊增祥撰联：“小住为佳，且吃了赵州茶去；曰归曰缓，试同歌陌上花来”。憩于亭内，细赏周边风景，可领略九溪独特魅力。",
                        "time": "20-30分钟"}, "27": {"id": "27", "name": "余杭蓝莓采摘",
                                                   "img": "http://dimg06.c-ctrip.com/images/fd/tg/g2/M09/23/98/CghzgFV6ScOACXyCAAJn1e9f08s208_C_1600_1200_Mtg_7.jpg",
                                                   "tags": "农家乐",
                                                   "des": "蓝莓园种植从2008年开始，隔山与双溪漂流为邻，这里四周群山环抱，空气清新，没有污染。方圆几里地没有人居住，生态环境一流。园区总面积有200多亩，种植蓝莓面积有120亩，进入盛产期7年的蓝莓有1万棵，亩产量是600到1000斤，我们种植的主要品种有南方高丛奥尼尔，夏普蓝，成熟期是五月底到六月中旬。兔眼蓝莓有粉蓝，灿烂，杰兔，成熟期是六月中旬到七月底，最后成熟的就是园蓝，在七月底到八月。三年生苗一万棵，已有少量挂果。",
                                                   "time": ""}, "28": {"id": "28", "name": "双泉村",
                                                                       "img": "http://dimg03.c-ctrip.com/images/tg/063/997/922/912c3a0071d14646b36549457e24eaed_C_1600_1200_Mtg_7.jpg",
                                                                       "tags": "乡村",
                                                                       "des": "建德市大慈岩镇双泉村位于建德市大慈岩镇西南部，由泉山和小泉两个自然村合并组成。该村白莲栽培历史已有1000余年，留下了一定规模的古建筑，是诸葛亮第49代后裔的聚居地。村内环境优美，基础设施基本完善，依靠十里荷花景点，将莲文化、诸葛文化、畲族文化和泉文化相结合，发展到极致。",
                                                                       "time": "2-4小时"},
                 "29": {"id": "29", "name": "孙花翁墓", "img": "", "tags": "陵园/墓地",
                        "des": "孙花翁墓位于今浙江省杭州市西湖区北山路29至30号之间。孙花翁去世后，他的墓很特别。墓顶竟是用铁浇铸成的。尔后长期湮没不见，至光绪年间为杭州大藏书家丁松生发现后重筑，并请大学者俞樾撰《孙花翁墓征序》碑立于墓前。",
                        "time": "建议20-40分钟"}, "30": {"id": "30", "name": "牡丹亭", "img": "", "tags": "古迹",
                                                     "des": "牡丹亭位于西湖风景区花港观鱼内，牡丹园建成于1954年冬，和红鱼池齐名，是花港观鱼的两大主景区之一。牡丹园最高处是重檐八角攒尖顶的牡丹亭，匾额由当代文学家茅盾题写。",
                                                     "time": "20-40分钟"}}



sight_tags = [','.join(item['tags'].decode('utf8').split()) for item in sight_details.values()]

sight_tags = list(set(','.join(sight_tags).split(',')))
print('the number of tags is : %d'%len(sight_tags))

print(','.join(sight_tags))

def ood_detecion(utterence):
    """ 话语 OOD 检测 —— 有效语义检测

   :param utterence: 用户话语
   :return:
   """
    keywords = [u'评分', u'评价', u'热门',u'类型']
    is_ood = True
    # 有效语义
    indomain_keyword = keywords + sight_names +sight_tags
    if any([utterence.__contains__(item) for item in indomain_keyword]):
        is_ood = False
    return is_ood
